{
  "posts": [
    {
      "id": 1,
      "title": "سوال 1",
      "question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    },
    {
      "title": "123",
      "question": "456",
      "id": 2
    },
    {
      "title": "چی؟",
      "question": "کجا؟",
      "id": 4
    },
    {
      "title": "چیتدقثنل",
      "question": "کجاثبثب",
      "id": 5
    },
    {
      "title": "vfdbf",
      "question": "dfdf",
      "id": 6
    },
    {
      "title": "4521",
      "question": "0122",
      "id": 7
    },
    {
      "title": "4521",
      "question": "0122",
      "id": 8
    },
    {
      "title": "4521",
      "question": "0122",
      "id": 9
    },
    {
      "title": "",
      "question": "",
      "id": 10
    },
    {
      "title": "سلام",
      "question": "مکزیزمیئرمنی",
      "id": 11
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "Local Storage یک مکان ذخیره‌سازی هست که توی مرورگر کاربر وجود داره که این امکان رو به ما میده تا با جاوا اسکریپت یه سری اطلاعات رو ذخیره و استفاده کنیم. در واقع عملیات ثبت، خواندن، بروزرسانی و حذف (CRUD) رو می‌تونیم با فضایی که در اختیار داریم انجام بدیم. اطلاعاتی که در Local Storage ذخیره میشه دائمی هست. یعنی اگه کاربر تب مرورگر و یا حتی خود مرورگر رو ببنده، این اطلاعات حذف نمیشن.",
      "postId": 1
    },
    {
      "id": 2,
      "body": "Local Storage چهار متد در اختیار ما قرار داده تا عملیات CRUD رو انجام بدیم. این 4 متد شامل:\n\nsetItem()\ngetItem()\nremoveItem()\nclear()",
      "postId": 1
    },
    {
      "id": 3,
      "body": "()setItem\nاین متد برای زمانی استفاده میشه که می‌خوایم یه سری اطلاعات رو توی Local Storage ثبت و یا اطلاعات قبلی رو ویرایش کنیم. این متد دو آرگومان می‌گیره. اولی کلید اون مقداری که قراره ثبت یا ویرایش بشه. پارامتر دوم شامل مقدار این کلید هست:\n\nlocalStorage.setItem('name', 'James Rodriguez');\nتو این مثال name کلید و James Rodriguez مقدار این کلید هست.\n\nاین مثال خیلی ساده بود. ما می‌تونیم یک مقدار پیچیده‌تر مثلاً یک آبجکت رو توی Local Storage ذخیره کنیم. باید دقت داشته باشیم که توی Local Storage باید رشته ذخیره کنیم. پس قبل از ذخیره آبجکت، باید اون رو تبدیل به رشته کنیم:",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}